# use this when there is strong relation ship between categorical
# independent feature and the target feature

In [1]:
import pandas as pd 

#create a sample dataframe with a categorical variable and a target variable

df=pd.DataFrame({
    'city':['new york','london','paris','tokyo','new york','paris'],
    'price':[200,150,300, 250,180,320]
})

In [2]:
df

       city  price
0  new york    200
1    london    150
2     paris    300
3     tokyo    250
4  new york    180
5     paris    320

In [5]:
#calculate the mean price for the each city
#when outlier take median

mean_price=df.groupby('city')['price'].mean().to_dict()

In [6]:
mean_price

{'london': 150.0, 'new york': 190.0, 'paris': 310.0, 'tokyo': 250.0}

In [7]:
#replace each city with its mean
df['city_encoded']=df['city'].map(mean_price)

In [8]:
df

       city  price  city_encoded
0  new york    200         190.0
1    london    150         150.0
2     paris    300         310.0
3     tokyo    250         250.0
4  new york    180         190.0
5     paris    320         310.0